
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЗарплатаТренеров.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗарплатаТренеров.Дата,
	|	ЗарплатаТренеров.КонецПериода,
	|	ЗарплатаТренеров.Тренер,
	|	ЗарплатаТренеров.Зарплата.(
	|		Ставка,
	|		КоличествоПроведенныхУслуг,
	|		СуммаЗаУслуги,
	|		СуммаЗаработнойПлаты
	|	)
	|ИЗ
	|	Документ.ЗарплатаТренеров КАК ЗарплатаТренеров
	|ГДЕ
	|	ЗарплатаТренеров.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗарплатаШапка = Макет.ПолучитьОбласть("ЗарплатаШапка");
	ОбластьЗарплата = Макет.ПолучитьОбласть("Зарплата");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьЗарплатаШапка);
		ВыборкаЗарплата = Выборка.Зарплата.Выбрать(); 
		СуммаИтог = 0;
		СуммаИтого = "";
		Пока ВыборкаЗарплата.Следующий() Цикл
			ОбластьЗарплата.Параметры.Заполнить(ВыборкаЗарплата);
			ТабДок.Вывести(ОбластьЗарплата, ВыборкаЗарплата.Уровень());
			СуммаИтог = СуммаИтог + ВыборкаЗарплата.СуммаЗаработнойПлаты;
		КонецЦикла;
        СуммаИтого = ЧислоПрописью(СуммаИтог, "Л = ru_RU; ДП = Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек");  
		ОбластьИтог.Параметры.Итог = СуммаИтог;
		ОбластьИтог.Параметры.ИтогПроп = СуммаИтого; 
		ТабДок.Вывести(ОбластьИтог);
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
