
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиОборудования Приход
	Движения.ОстаткиОборудования.Записывать = Истина;
	Для Каждого ТекСтрокаЗакупка Из Закупка Цикл
		Движение = Движения.ОстаткиОборудования.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Оборудование = ТекСтрокаЗакупка.Оборудование;
		Движение.Количество = ТекСтрокаЗакупка.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
