&НаСервере
Процедура КлиентПриИзмененииНаСервере()  
	Если Объект.Клиент <> Неопределено Тогда
        ТипАбонемента = Объект.Клиент.ТипАбонемента;
        Если Не ТипАбонемента = Неопределено Тогда
           Объект.ТипАбонемента = ТипАбонемента;
        КонецЕсли;
	КонецЕсли;  
		
    Объект.Опции.Очистить();
    ТипАбонемента = Объект.ТипАбонемента;

    ЗаписьТипаАбонемента = Справочники.ТипАбонемента.НайтиПоНаименованию(ТипАбонемента);

    Если ЗаписьТипаАбонемента <> Неопределено Тогда
     
        Для Каждого Строка Из ЗаписьТипаАбонемента.Опции Цикл
            НоваяСтрока = Объект.Опции.Добавить();
            НоваяСтрока.Услуги = Строка.Услуги; 
            НоваяСтрока.Количество = Строка.Количество;
        КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	КлиентПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	Если Объект.ТипАбонемента <> Неопределено Тогда 
        Если Объект.Дата <> Неопределено Тогда
            Выбор = Объект.ТипАбонемента; 
            Если Выбор = Справочники.ТипАбонемента.НайтиПоНаименованию("Standart") Тогда
                Объект.ДатаОкончанияИспользования = ДобавитьМесяц(Объект.Дата, 6); 
			ИначеЕсли Выбор = Справочники.ТипАбонемента.НайтиПоНаименованию("Premium") Тогда
                Объект.ДатаОкончанияИспользования = ДобавитьМесяц(Объект.Дата, 9); 
            ИначеЕсли Выбор = Справочники.ТипАбонемента.НайтиПоНаименованию("Lux") Тогда
                Объект.ДатаОкончанияИспользования = ДобавитьМесяц(Объект.Дата, 12); 
			КонецЕсли;
        КонецЕсли;    
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры
