&НаКлиенте
Процедура ЗанятиеКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Занятие.ТекущиеДанные;
	РаботаСЦенами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры   

&НаКлиенте
Процедура ЗанятиеЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Занятие.ТекущиеДанные;
	РаботаСЦенами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ЗанятиеУслугиПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Занятие.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(
	Объект.Дата, СтрокаТабличнойЧасти.Услуги);
	РаботаСЦенами.РассчитатьСумму(СтрокаТабличнойЧасти) 
	 
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Занятие.ТекущиеДанные; 
	Для Каждого СтрокаТабличнойЧасти Из Объект.Занятие Цикл   
		СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Услуги);    
		РаботаСЦенами.РассчитатьСумму(СтрокаТабличнойЧасти); 
	КонецЦикла;
КонецПроцедуры
