Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
 	Префикс = Обмен.ПолучитьПрефиксНомера();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОборотПродажАбонементов 
	Движения.ОборотПродажАбонементов.Записывать = Истина;
	Для Каждого ТекСтрокаПродажа Из Продажа Цикл
		Движение = Движения.ОборотПродажАбонементов.Добавить();
		Движение.Период = Дата;
		Движение.ДатаПродажи = Дата;
		Движение.Менеджер = Менеджер;
		Движение.Клиент = Клиент;
		Движение.ТипАбонемента = ТекСтрокаПродажа.ТипАбонемента;
		Движение.Цена = ТекСтрокаПродажа.Цена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
