
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ВозвратАбонементов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВозвратАбонементов.Дата,
	|	ВозвратАбонементов.ДатаПокупки,
	|	ВозвратАбонементов.Клиент,
	|	ВозвратАбонементов.Менеджер,
	|	ВозвратАбонементов.Возврат.(
	|		Абонемент,
	|		ТипАбонемента,
	|		СтоимостьАбонемента,
	|		СрокИспользования,
	|		СуммаКВозврату
	|	)
	|ИЗ
	|	Документ.ВозвратАбонементов КАК ВозвратАбонементов
	|ГДЕ
	|	ВозвратАбонементов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВозвратШапка = Макет.ПолучитьОбласть("ВозвратШапка");
	ОбластьВозврат = Макет.ПолучитьОбласть("Возврат");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьВозвратШапка);
		ВыборкаВозврат = Выборка.Возврат.Выбрать();
		СуммаИтог = 0;
		СуммаИтого = "";
		Пока ВыборкаВозврат.Следующий() Цикл
			ОбластьВозврат.Параметры.Заполнить(ВыборкаВозврат);
			ТабДок.Вывести(ОбластьВозврат, ВыборкаВозврат.Уровень());
			СуммаИтог = СуммаИтог + ВыборкаВозврат.СуммаКВозврату;
		КонецЦикла;
		
		СуммаИтого = ЧислоПрописью(СуммаИтог, "Л = ru_RU; ДП = Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек");  
		ОбластьИтог.Параметры.Итог = СуммаИтог;
		ОбластьИтог.Параметры.Итого = СуммаИтого; 
		ТабДок.Вывести(ОбластьИтог);

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
