
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.СписаниеОборудования.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеОборудования.Дата,
	|	СписаниеОборудования.Менеджер,
	|	СписаниеОборудования.Номер,
	|	СписаниеОборудования.Списание.(
	|		Оборудование,
	|		Количество
	|	)
	|ИЗ
	|	Документ.СписаниеОборудования КАК СписаниеОборудования
	|ГДЕ
	|	СписаниеОборудования.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписаниеШапка = Макет.ПолучитьОбласть("СписаниеШапка");
	ОбластьСписание = Макет.ПолучитьОбласть("Списание");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписаниеШапка);
		ВыборкаСписание = Выборка.Списание.Выбрать();
		Пока ВыборкаСписание.Следующий() Цикл
			ОбластьСписание.Параметры.Заполнить(ВыборкаСписание);
			ТабДок.Вывести(ОбластьСписание, ВыборкаСписание.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
