
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиОборудования Расход
	Движения.ОстаткиОборудования.Записывать = Истина;
	Для Каждого ТекСтрокаСписание Из Списание Цикл
		Движение = Движения.ОстаткиОборудования.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Оборудование = ТекСтрокаСписание.Оборудование;
		Движение.Количество = ТекСтрокаСписание.Количество;
	КонецЦикла;
	
	 Движения.Записать();  
	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		//Проверить отрицательные остатки
		Запрос3 = Новый Запрос;
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		Запрос3.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос3.Текст = "ВЫБРАТЬ
		               |	ОстаткиОборудованияОстатки.Оборудование КАК Оборудование,
		               |	ОстаткиОборудованияОстатки.КоличествоОстаток КАК КоличествоОстаток
		               |ИЗ
		               |	РегистрНакопления.ОстаткиОборудования.Остатки КАК ОстаткиОборудованияОстатки
		               |ГДЕ
		               |	ОстаткиОборудованияОстатки.КоличествоОстаток < 0";
		
	РезультатЗапроса = Запрос3.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Не хватает " + Строка(- ВыборкаДетальныеЗаписи
	.КоличествоОстаток) + " единиц оборудования """
	+ ВыборкаДетальныеЗаписи.Оборудование + """";
	Сообщение.Сообщить();
	Отказ = Истина;
КонецЦикла;         
КонецЕсли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
