
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Абонемент.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Абонемент.Дата,
	|	Абонемент.ДатаОкончанияИспользования,
	|	Абонемент.Клиент,
	|	Абонемент.Номер,
	|	Абонемент.ТипАбонемента,
	|	Абонемент.Опции.(
	|		Услуги,
	|		Количество
	|	)
	|ИЗ
	|	Документ.Абонемент КАК Абонемент
	|ГДЕ
	|	Абонемент.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьОпцииШапка = Макет.ПолучитьОбласть("ОпцииШапка");
	ОбластьОпции = Макет.ПолучитьОбласть("Опции");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьОпцииШапка);
		ВыборкаОпции = Выборка.Опции.Выбрать();
		Пока ВыборкаОпции.Следующий() Цикл
			ОбластьОпции.Параметры.Заполнить(ВыборкаОпции);
			ТабДок.Вывести(ОбластьОпции, ВыборкаОпции.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
