
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Запись.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Запись.ВремяНачала,
	|	Запись.ВремяОкончания,
	|	Запись.Дата,
	|	Запись.Зал,
	|	Запись.Клиент,
	|	Запись.Тренер,
	|	Запись.Занятие.(
	|		Услуги,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Запись КАК Запись
	|ГДЕ
	|	Запись.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗанятиеШапка = Макет.ПолучитьОбласть("ЗанятиеШапка");
	ОбластьЗанятие = Макет.ПолучитьОбласть("Занятие");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьЗанятиеШапка);
		ВыборкаЗанятие = Выборка.Занятие.Выбрать(); 
		СуммаИтог = 0;
		СуммаИтого = "";
		Пока ВыборкаЗанятие.Следующий() Цикл
			ОбластьЗанятие.Параметры.Заполнить(ВыборкаЗанятие);
			ТабДок.Вывести(ОбластьЗанятие, ВыборкаЗанятие.Уровень()); 
			СуммаИтог = СуммаИтог + ВыборкаЗанятие.Сумма;
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка); 
        СуммаИтого = ЧислоПрописью(СуммаИтог, "Л = ru_RU; ДП = Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек");  
		ОбластьИтог.Параметры.Итог = СуммаИтог;
		ОбластьИтог.Параметры.ИтогПроп = СуммаИтого;
		ТабДок.Вывести(ОбластьИтог);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
