
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПродажаАбонементов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПродажаАбонементов.Дата,
	|	ПродажаАбонементов.Клиент,
	|	ПродажаАбонементов.Менеджер,
	|	ПродажаАбонементов.Продажа.(
	|		Абонемент,
	|		ТипАбонемента,
	|		Цена
	|	)
	|ИЗ
	|	Документ.ПродажаАбонементов КАК ПродажаАбонементов
	|ГДЕ
	|	ПродажаАбонементов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПродажаШапка = Макет.ПолучитьОбласть("ПродажаШапка");
	ОбластьПродажа = Макет.ПолучитьОбласть("Продажа");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПродажаШапка);
		ВыборкаПродажа = Выборка.Продажа.Выбрать();
		Пока ВыборкаПродажа.Следующий() Цикл
			ОбластьПродажа.Параметры.Заполнить(ВыборкаПродажа);
			ТабДок.Вывести(ОбластьПродажа, ВыборкаПродажа.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
