&НаСервере
Процедура КлиентПриИзмененииНаСервере()  
	Клиент = Объект.Клиент;  
	Абонемент = Элементы.ПродажаАбонемент; 
	Если Клиент <> Неопределено Тогда  
        Абонементы = Документы.Абонемент.НайтиПоРеквизиту("Клиент", Клиент); 
		Если Не Абонементы.Пустая() Тогда   
	            Объект.Продажа.Очистить();   
				Объект.Номер = Абонементы.Номер; 
				Объект.Дата = Абонементы.Дата;
                НоваяСтрока = Объект.Продажа.Добавить();
                НоваяСтрока.Абонемент = Абонементы; 
				НоваяСтрока.ТипАбонемента = Клиент.ТипАбонемента;
				НоваяСтрока.Цена = РаботаСДокументами.ЦенаАбонементов(Объект.Дата, НоваяСтрока.ТипАбонемента);
        Иначе
            Объект.Продажа.Очистить();
            Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст ="Абонементы не найдены для данного клиента.";
			Сообщение.Сообщить()
        КонецЕсли;
    Иначе
        Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст ="Клиент не выбран.";
		Сообщение.Сообщить()
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	КлиентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Продажа.ТекущиеДанные; 
	Для Каждого СтрокаТабличнойЧасти Из Объект.Продажа Цикл   
		СтрокаТабличнойЧасти.Цена = РаботаСдокументами.ЦенаАбонементов(Объект.Дата, СтрокаТабличнойЧасти.ТипАбонемента);
	КонецЦикла;
КонецПроцедуры